# $$Auto Password Generator$$

### A valid password is having

#### i) Atleast one upper case letter.
#### ii) Atleast one lower case letter.
#### iii) Atleast one numeric value.
#### iv) Atleast one special character.

## 1. Import all the packages

In [1]:
import random
import pandas as pd
import numpy as np
import string as st

## 2. Create all lists.

In [2]:
numbers = list(map(str, range(10)))
lowercase_letter = list(chr(i + ord('a')) for i in range(26))
uppercase_letter = list(chr(i + ord('A')) for i in range(26))
special_char = [chr(i) for i in range(40,127) if not chr(i).isalnum()]

In [3]:
fixed_password = numbers + lowercase_letter + uppercase_letter + special_char

In [4]:
print(fixed_password)

['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '(', ')', '*', '+', ',', '-', '.', '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`', '{', '|', '}', '~']

## 3. Create Password

In [5]:
# This producing random value from all four lists.
def ran():
    random_pass = random.choice(numbers) + random.choice(lowercase_letter) + random.choice(uppercase_letter) +random.choice(special_char)
    return random_pass

max_length = list(range(4, 9))
emp_password = []
num_emp = int(input())
for k in range(num_emp):
    value1 = ran()
    value2 = ''.join(random.choice(fixed_password) for j in range(random.choice(max_length)))
    emp_password.append(value1+value2)

5

In [6]:
emp_password

['7vX;lz:|?', '3nH`edjTekY4', '1eR<BZVu', '3yH)5@/GZTu', '5cE+[K)_9>`']

In [7]:
password = {'password':emp_password}

### 3.1 Create password dataframe

In [8]:
df_password = pd.DataFrame(password)

In [9]:
df_password

       password
0     7vX;lz:|?
1  3nH`edjTekY4
2      1eR<BZVu
3   3yH)5@/GZTu
4   5cE+[K)_9>`

## 4. Creating Employee Dataframe

In [10]:
df_employee = pd.DataFrame(columns=['Name', 'Age', 'Gender', 'Experience', 'Salary'])

### 4.1 Inserting data into employee dataframe.

In [11]:
for i in range(num_emp):
    df_employee.loc[i, 'Name'] = input('Name: ')
    df_employee.loc[i, 'Age'] = input('Age: ')
    df_employee.loc[i, 'Gender'] = input('Gender: ')
    df_employee.loc[i, 'Experience'] = input('Experience: ')
    df_employee.loc[i, 'Salary'] = input('Salary: ')

Name: Vijayant Shrivastav
Age: 22
Gender: Male
Experience: 0
Salary: 3000000
Name: Amber Goutam
Age: 21
Gender: Male
Experience: 0
Salary: 450000
Name: Mayank Verma
Age: 24
Gender: Male
Experience: 2
Salary: 800000
Name: Rishi Gupta
Age: 22
Gender: Male
Experience: 1
Salary: 650000
Name: Amit Kumar
Age: 22
Gender: Male
Experience: 1
Salary: 800000

In [12]:
df_employee

                  Name Age Gender Experience   Salary
0  Vijayant Shrivastav  22   Male          0  3000000
1         Amber Goutam  21   Male          0   450000
2         Mayank Verma  24   Male          2   800000
3          Rishi Gupta  22   Male          1   650000
4           Amit Kumar  22   Male          1   800000

## 5. Setting passwords of the employees.

In [13]:
complete_df = pd.concat([df_employee, df_password], axis=1)

In [14]:
complete_df

                  Name Age Gender Experience   Salary      password
0  Vijayant Shrivastav  22   Male          0  3000000     7vX;lz:|?
1         Amber Goutam  21   Male          0   450000  3nH`edjTekY4
2         Mayank Verma  24   Male          2   800000      1eR<BZVu
3          Rishi Gupta  22   Male          1   650000   3yH)5@/GZTu
4           Amit Kumar  22   Male          1   800000   5cE+[K)_9>`

## 6. Exporting data to csv file.

In [15]:
complete_df.to_csv('Employee_data.csv')

## 7. Checking the data in csv file.

In [16]:
read_df = pd.read_csv('Employee_data.csv')
read_df

,Unnamed: 0,Name,Age,Gender,Experience,Salary,password
0,0,Vijayant Shrivastav,22,Male,0,3000000,7vX;lz:|?
1,1,Amber Goutam,21,Male,0,450000,3nH`edjTekY4
2,2,Mayank Verma,24,Male,2,800000,1eR<BZVu
3,3,Rishi Gupta,22,Male,1,650000,3yH)5@/GZTu
4,4,Amit Kumar,22,Male,1,800000,5cE+[K)_9>`